cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/cask'

# Browsers
cask 'google-chrome'
cask 'firefox'

# Apps
cask 'daisydisk'
# cask 'slack'

# Security
cask '1password'

# Editors
cask 'iterm2'
cask 'intellij-idea'
# cask 'visual-studio'
cask 'visual-studio-code'

#Dev Ops Tools
# cask 'ccmenu18'
cask 'docker'

# Tools
# cask 'tunnelblick'
# cask 'gpg-suite'
cask 'postman'

# DB Tools
cask 'dbeaver-community'
# cask 'sequel-pro'

#Languages
cask 'java'

tap 'homebrew/cask-versions'

# Terminal
brew 'wget'
brew 'ack'
brew 'tmux'
brew 'vim'
brew 'ctags'
brew 'tree'

# Version Control
brew 'git'
brew 'tig'

# Languages
# brew 'go'
# brew 'rust'
brew 'node'
brew 'python'

# Other Tools
brew 'maven'
brew 'ant'
brew 'pow'
brew 'autoconf'
brew 'automake'
brew 'libtool'
brew 'libyaml'
brew 'openssl'

# Data Stores And Logging
# brew 'mongodb'
# brew 'elasticsearch'
# brew 'logstash'
# brew 'postgresql'
# brew 'sqlite'
# brew 'mysql'
# brew 'memcached'
# brew 'redis'
