cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'caskroom/cask'

# Browsers
cask 'google-chrome'
cask 'firefox'

# Apps
cask 'dropbox'
cask 'skype'
cask 'libreoffice'
cask 'vlc'
cask 'silverlight'
cask 'daisydisk'
cask 'slack'

# Security
cask '1password'

# Editors
cask 'iterm2'
cask 'sublime-text'
cask 'atom'
cask 'macvim'
cask 'intellij-idea'
cask 'visual-studio'
cask 'visual-studio-code'

#Dev Ops Tools
cask 'ccmenu18'
cask 'vagrant'
cask 'docker'

# Tools
cask 'virtualbox'
cask 'xquartz'
cask 'pckeyboardhack'
cask 'tunnelblick'
cask 'gpg-suite'
cask 'postman'

# DB Tools
cask 'dbeaver-community'
cask 'sequel-pro'

#Languages
cask 'java'
cask 'java6'

tap 'caskroom/versions'

# Terminal
brew 'wget'
brew 'ack'
brew 'tmux'
brew 'vim', args: ['--override-system-vi']
brew 'ctags'
brew 'tree'

# Version Control
brew 'git'
brew 'tig'

# Languages
brew 'go'
brew 'rust'
brew 'node'
brew 'python'

# Other Tools
brew 'maven'
brew 'ant'
brew 'pow'
brew 'autoconf'
brew 'automake'
brew 'heroku-toolbelt'
brew 'libtool'
brew 'libyaml'
brew 'openssl'

# Data Stores And Logging
brew 'mongodb'
brew 'elasticsearch'
brew 'logstash'
brew 'postgresql'
brew 'sqlite'
brew 'mysql'
brew 'memcached'
brew 'redis'

tap 'homebrew/versions'
